This is the advance pandas .

Adding Column

In [1]:
import pandas as pd

In [2]:
data={
    "Name":["Ram",'Shyam','Ghanshyam','Dhanshyam','Aditi','Jagdish','Raj','Simran'],
    "Age":[28,34,22,30,29,40,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,90,78,92,88,95,80,89]

}
df=pd.DataFrame(data)

Adding Column In A DataFrame

In [8]:
df["Increased_Salary"]=df["Salary"]*0.1+df["Salary"]
print(df)

        Name  Age  Salary  Performance_Score    Bonus  Increased_Salary
0        Ram   28   50000                 85  55000.0           55000.0
1      Shyam   34   60000                 90  66000.0           66000.0
2  Ghanshyam   22   45000                 78  49500.0           49500.0
3  Dhanshyam   30   52000                 92  57200.0           57200.0
4      Aditi   29   49000                 88  53900.0           53900.0
5    Jagdish   40   70000                 95  77000.0           77000.0
6        Raj   25   48000                 80  52800.0           52800.0
7     Simran   32   58000                 89  63800.0           63800.0

Adding New Column in a DataFrame

In [11]:
df.insert(2,"Employee_ID",[10,20,30,40,50,60,70,80])
print(df)

   Employee_id       Name  Employee_ID  Age  Salary  Performance_Score  \
0           10        Ram           10   28   50000                 85
1           20      Shyam           20   34   60000                 90
2           30  Ghanshyam           30   22   45000                 78
3           40  Dhanshyam           40   30   52000                 92
4           50      Aditi           50   29   49000                 88
5           60    Jagdish           60   40   70000                 95
6           70        Raj           70   25   48000                 80
7           80     Simran           80   32   58000                 89

     Bonus  Increased_Salary
0  55000.0           55000.0
1  66000.0           66000.0
2  49500.0           49500.0
3  57200.0           57200.0
4  53900.0           53900.0
5  77000.0           77000.0
6  52800.0           52800.0
7  63800.0           63800.0

Updating Values

In [12]:
df.loc[0,"Salary"]=100000
print(df)

   Employee_id       Name  Employee_ID  Age  Salary  Performance_Score  \
0           10        Ram           10   28  100000                 85
1           20      Shyam           20   34   60000                 90
2           30  Ghanshyam           30   22   45000                 78
3           40  Dhanshyam           40   30   52000                 92
4           50      Aditi           50   29   49000                 88
5           60    Jagdish           60   40   70000                 95
6           70        Raj           70   25   48000                 80
7           80     Simran           80   32   58000                 89

     Bonus  Increased_Salary
0  55000.0           55000.0
1  66000.0           66000.0
2  49500.0           49500.0
3  57200.0           57200.0
4  53900.0           53900.0
5  77000.0           77000.0
6  52800.0           52800.0
7  63800.0           63800.0

In [13]:
# Increasing salary by 5 percent
df["Salary"]=df["Salary"]*0.5
print(df)

   Employee_id       Name  Employee_ID  Age   Salary  Performance_Score  \
0           10        Ram           10   28  50000.0                 85
1           20      Shyam           20   34  30000.0                 90
2           30  Ghanshyam           30   22  22500.0                 78
3           40  Dhanshyam           40   30  26000.0                 92
4           50      Aditi           50   29  24500.0                 88
5           60    Jagdish           60   40  35000.0                 95
6           70        Raj           70   25  24000.0                 80
7           80     Simran           80   32  29000.0                 89

     Bonus  Increased_Salary
0  55000.0           55000.0
1  66000.0           66000.0
2  49500.0           49500.0
3  57200.0           57200.0
4  53900.0           53900.0
5  77000.0           77000.0
6  52800.0           52800.0
7  63800.0           63800.0

Removing Column

In [14]:
df.drop(columns=["Name"],inplace=True)
print(df)

   Employee_id  Employee_ID  Age   Salary  Performance_Score    Bonus  \
0           10           10   28  50000.0                 85  55000.0
1           20           20   34  30000.0                 90  66000.0
2           30           30   22  22500.0                 78  49500.0
3           40           40   30  26000.0                 92  57200.0
4           50           50   29  24500.0                 88  53900.0
5           60           60   40  35000.0                 95  77000.0
6           70           70   25  24000.0                 80  52800.0
7           80           80   32  29000.0                 89  63800.0

   Increased_Salary
0           55000.0
1           66000.0
2           49500.0
3           57200.0
4           53900.0
5           77000.0
6           52800.0
7           63800.0

In [15]:
df.drop(columns=["Salary","Age"],inplace=True)
print(df)

   Employee_id  Employee_ID  Performance_Score    Bonus  Increased_Salary
0           10           10                 85  55000.0           55000.0
1           20           20                 90  66000.0           66000.0
2           30           30                 78  49500.0           49500.0
3           40           40                 92  57200.0           57200.0
4           50           50                 88  53900.0           53900.0
5           60           60                 95  77000.0           77000.0
6           70           70                 80  52800.0           52800.0
7           80           80                 89  63800.0           63800.0

In [22]:
data={
    "Name":["Ram",'Shyam','Ghanshyam','Dhanshyam','Aditi','Jagdish','Raj','Simran'],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]

}
df=pd.DataFrame(data)
print(df.isnull())
print(df.isnull().sum())

    Name    Age  Salary  Performance_Score
0  False  False   False              False
1  False   True   False               True
2  False  False   False              False
3  False  False   False              False
4  False  False   False              False
5  False  False   False              False
6  False  False   False              False
7  False  False   False              False
Name                 0
Age                  1
Salary               0
Performance_Score    1
dtype: int64

Handling The Missing Value

In [23]:
# Remving the missing values from a column 
df.dropna(inplace=True)
print(df)

        Name   Age  Salary  Performance_Score
0        Ram  28.0   50000               85.0
2  Ghanshyam  22.0   45000               78.0
3  Dhanshyam  30.0   52000               92.0
4      Aditi  29.0   49000               88.0
5    Jagdish  40.0   70000               95.0
6        Raj  25.0   48000               80.0
7     Simran  32.0   58000               89.0

In [24]:
data={
    "Name":["Ram",'Shyam','Ghanshyam','Dhanshyam','Aditi','Jagdish','Raj','Simran'],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]

}
df=pd.DataFrame(data)

In [25]:
df.fillna(0,inplace=True)
print(df)

        Name   Age  Salary  Performance_Score
0        Ram  28.0   50000               85.0
1      Shyam   0.0   60000                0.0
2  Ghanshyam  22.0   45000               78.0
3  Dhanshyam  30.0   52000               92.0
4      Aditi  29.0   49000               88.0
5    Jagdish  40.0   70000               95.0
6        Raj  25.0   48000               80.0
7     Simran  32.0   58000               89.0

In [1]:
import pandas as pd
data={
    "Name":["Ram",'Shyam','Ghanshyam','Dhanshyam','Aditi','Jagdish','Raj','Simran'],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]

}
df=pd.DataFrame(data)
df.dropna(axis=1,inplace=True)

In [2]:
print(df)

        Name  Salary
0        Ram   50000
1      Shyam   60000
2  Ghanshyam   45000
3  Dhanshyam   52000
4      Aditi   49000
5    Jagdish   70000
6        Raj   48000
7     Simran   58000

In [4]:
import pandas as pd
data={
    "Name":["Ram",'Shyam','Ghanshyam','Dhanshyam','Aditi','Jagdish','Raj','Simran'],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]

}
df=pd.DataFrame(data)
df.fillna(1000,inplace=True)
print(df)

        Name     Age  Salary  Performance_Score
0        Ram    28.0   50000               85.0
1      Shyam  1000.0   60000             1000.0
2  Ghanshyam    22.0   45000               78.0
3  Dhanshyam    30.0   52000               92.0
4      Aditi    29.0   49000               88.0
5    Jagdish    40.0   70000               95.0
6        Raj    25.0   48000               80.0
7     Simran    32.0   58000               89.0

In [5]:
import pandas as pd
data={
    "Name":["Ram",'Shyam','Ghanshyam','Dhanshyam','Aditi','Jagdish','Raj','Simran'],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]

}
df=pd.DataFrame(data)

In [7]:
df["Age"].fillna(df["Age"].mean(),inplace=True)
print(df)

        Name        Age  Salary  Performance_Score
0        Ram  28.000000   50000               85.0
1      Shyam  29.428571   60000                NaN
2  Ghanshyam  22.000000   45000               78.0
3  Dhanshyam  30.000000   52000               92.0
4      Aditi  29.000000   49000               88.0
5    Jagdish  40.000000   70000               95.0
6        Raj  25.000000   48000               80.0
7     Simran  32.000000   58000               89.0

C:\Users\ronit2007\AppData\Local\Temp\ipykernel_22336\155784291.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(df["Age"].mean(),inplace=True)

In [9]:
import pandas as pd
data={
    "Name":["Ram",'Shyam','Ghanshyam','Dhanshyam','Aditi','Jagdish','Raj','Simran'],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]

}
df=pd.DataFrame(data)
df["Performance_Score"].fillna(df["Performance_Score"].mean(),inplace=True)
print(df)

        Name   Age  Salary  Performance_Score
0        Ram  28.0   50000          85.000000
1      Shyam   NaN   60000          86.714286
2  Ghanshyam  22.0   45000          78.000000
3  Dhanshyam  30.0   52000          92.000000
4      Aditi  29.0   49000          88.000000
5    Jagdish  40.0   70000          95.000000
6        Raj  25.0   48000          80.000000
7     Simran  32.0   58000          89.000000

C:\Users\ronit2007\AppData\Local\Temp\ipykernel_22336\2485823954.py:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Performance_Score"].fillna(df["Performance_Score"].mean(),inplace=True)

Interpolation : Filling estimated value in missing value .
- preserve data integrity .
- smooth trends .
- Avoid data loss .

In [10]:
import pandas as pd
data={
    "Name":["Ram",'Shyam','Ghanshyam','Dhanshyam','Aditi','Jagdish','Raj','Simran'],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]

}
df=pd.DataFrame(data)
df.interpolate(method="linear",axis=0,inplace=True)

C:\Users\ronit2007\AppData\Local\Temp\ipykernel_22336\3962552568.py:10: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate(method="linear",axis=0,inplace=True)

In [11]:
print(df)

        Name   Age  Salary  Performance_Score
0        Ram  28.0   50000               85.0
1      Shyam  25.0   60000               81.5
2  Ghanshyam  22.0   45000               78.0
3  Dhanshyam  30.0   52000               92.0
4      Aditi  29.0   49000               88.0
5    Jagdish  40.0   70000               95.0
6        Raj  25.0   48000               80.0
7     Simran  32.0   58000               89.0

In [17]:
data={
    "Time":[1,None,3,4,5],
    "Value":[10,None,30,40,None]
}
df=pd.DataFrame(data)
df["Value"].interpolate(method="linear",axis=0,inplace=True)
print(df)

   Time  Value
0   1.0   10.0
1   NaN   20.0
2   3.0   30.0
3   4.0   40.0
4   5.0   40.0

C:\Users\ronit2007\AppData\Local\Temp\ipykernel_22336\2146719961.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Value"].interpolate(method="linear",axis=0,inplace=True)

Sorting and aggregation

In [18]:
# Sorting

In [21]:
data={
    "Name":["Ram",'Shyam','Ghanshyam','Dhanshyam','Aditi','Jagdish','Raj','Simran'],
    "Age":[28,None,22,30,29,40,25,32],
    "Salary":[50000,60000,45000,52000,49000,70000,48000,58000],
    "Performance_Score":[85,None,78,92,88,95,80,89]

}
df=pd.DataFrame(data)
df.sort_values(by="Salary",ascending=True,inplace=True)

In [22]:
print(df)

        Name   Age  Salary  Performance_Score
2  Ghanshyam  22.0   45000               78.0
6        Raj  25.0   48000               80.0
4      Aditi  29.0   49000               88.0
0        Ram  28.0   50000               85.0
3  Dhanshyam  30.0   52000               92.0
7     Simran  32.0   58000               89.0
1      Shyam   NaN   60000                NaN
5    Jagdish  40.0   70000               95.0

In [24]:
data={
    "Name":["Arun","Varun","Karun"],
    "Age":[28,34,22],
    "Salary":[10000,20000,30000]
}
df=pd.DataFrame(data)
df.sort_values(by=["Age","Salary"],ascending=[True,False],inplace=True)
print(df) # First prefference is given to first column

    Name  Age  Salary
2  Karun   22   30000
0   Arun   28   10000
1  Varun   34   20000

Summary Statistics

In [25]:
print(df["Age"].sum())

84

In [26]:
print(df["Salary"].mean())

20000.0

Grouping in pandas

In [27]:
data={
    "Name":["Arun","Varun","Karun","Narun","Marun"],
    "Age":[28,34,22,34,28],
    "Salary":[50000,60000,45000,52000,40000]
}
df=pd.DataFrame(data)

In [29]:
print(df.groupby("Age","Salary")["Salary"].sum())

ValueError: No axis named Salary for object type DataFrame

In [30]:
data={
    "Name":["Arun","Varun","Karun","Narun","Marun"],
    "Age":[28,34,22,34,28],
    "Salary":[50000,60000,45000,52000,40000]
}
df=pd.DataFrame(data)
print(df.groupby(["Age","Salary"])["Salary"].mean())

Age  Salary
22   45000     45000.0
28   40000     40000.0
     50000     50000.0
34   52000     52000.0
     60000     60000.0
Name: Salary, dtype: float64

1- sum()
2- mean()
3- count()
4- min()
5- max()
6- std()

Merging and joining

In [31]:
# Merging data frames

In [ ]:
df_customer=pd.DataFrame({
    "Customer_ID":[1,2,3],
    "Name":["Ramesh","Suresh","Kalpesh"]
})
df_order=pd.DataFrame({
    "Customer_ID":[1,2,4],
    "OrderAmount":[250,450,350]
})
print(pd.merge(df_customer,df_order,on="Customer_ID",how="inner"))
print(pd.concat(df_customer,df_order,axis=0,ignore_index=True))

   Customer_ID    Name  OrderAmount
0            1  Ramesh          250
1            2  Suresh          450

TypeError: concat() takes 1 positional argument but 2 positional arguments (and 2 keyword-only arguments) were given

In [39]:
df_customer=pd.DataFrame({
    "Customer_ID":[1,2,3],
    "Name":["Ramesh","Suresh","Kalpesh"]
})
df_order=pd.DataFrame({
    "Customer_ID":[1,2,4],
    "OrderAmount":[250,450,350]
})

In [42]:
print(pd.concat([df_order,df_customer],axis=1,ignore_index=True))

   0    1  2        3
0  1  250  1   Ramesh
1  2  450  2   Suresh
2  4  350  3  Kalpesh

In [3]:
import pandas as pd 
data={
    'Name':['Ronit','Rishi'],
    'Age':[20,23]
}
df=pd.DataFrame(data)
print(len(df.columns))

2